Tekla Open API Reference for Tekla Structures 2025
Rectangle.RectangleAttributes.Bulge Property
 The bulge value for the rectangle.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Bulge { get; set; }
Public Property Bulge As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Rectangle.RectangleAttributes Class
Tekla.Structures.Drawing Namespace